{
  "backend/main.mo": "Motoko backend defining Veda and language enums, mantra metadata, translations, audio storage, and query methods for retrieving mantra numbers and meanings.",
  "feature_evidence.json": "Feature evidence listing required frontend changes related to Samaveda mantra 47 visibility and initial default selections.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files, their roles, and recent dropdown and diagnostic-related changes.",
  "frontend/index.css": "Tailwind base layer defining light and dark theme color tokens and applying global background and text styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/public/_redirects": "Redirect rule sending all paths to index.html for SPA routing.",
  "frontend/public/404.html": "SPA-friendly 404 page that redirects all unknown routes back to the app entry point.",
  "frontend/src/App.tsx": "Main React component managing Veda, mantra, and language selections, deep-linking, auto-selection logic, diagnostics, and rendering mantra content.",
  "frontend/src/components/MantraAudioSection.tsx": "Component for playing or uploading mantra audio, with authentication checks and upload progress handling.",
  "frontend/src/components/MantraMetadataHeader.tsx": "Component that displays metadata text, visually emphasizing tokens ending with colons.",
  "frontend/src/hooks/useActor.ts": "Hook that manages creation of authenticated or anonymous backend actors and invalidates dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, wrapping AuthClient creation and exposing identity state and login helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching mantra numbers, meaning, text, metadata, and audio from the backend actor with caching and validation logic.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark theme CSS variables plus utility and component styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/selectValueGuards.ts": "Provides helpers to validate select values and ensure bigint selections are valid.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, components, and theming using CSS variables.",
  "project_state.json": "Tracks project state, known issues, and feature requests related to fixing missing mantra 47 and dropdown behaviors."
}