{
  "backend/main.mo": "Motoko backend defining Veda and language types, mantra data storage, comparison logic, queries, and audio upload support using blob-storage.",
  "feature_evidence.json": "Structured feature evidence listing features, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-written summaries describing the purpose of key frontend files including hooks, components, styles, and documentation.",
  "frontend/DEPLOYMENT.md": "Mainnet deployment guide explaining prerequisites, setup steps, and instructions for deploying the app to the Internet Computer.",
  "frontend/index.css": "Global Tailwind-based theme variables and styles defining light and dark mode color tokens.",
  "frontend/index.html": "Base HTML template mounting the React app and loading the main entry script.",
  "frontend/public/_redirects": "Netlify-style rule routing all paths to index.html for SPA behavior.",
  "frontend/public/404.html": "SPA fallback page redirecting deep links to index.html while preserving the original path via a redirect query.",
  "frontend/README.md": "Project overview describing features, live URL placeholder, canister IDs, tech stack, and deployment reference.",
  "frontend/src/App.tsx": "Main React application handling routing, deep links, dropdown state, data fetching, and rendering mantra content.",
  "frontend/src/components/MantraAudioSection.tsx": "Component providing audio playback and authenticated upload functionality with progress tracking and error handling.",
  "frontend/src/components/MantraMetadataHeader.tsx": "Splits metadata text into tokens and highlights tokens ending with ':' using a styled span.",
  "frontend/src/components/ShareArea.tsx": "Provides a UI card showing the current page URL with a button to copy it to the clipboard.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and auth client behavior.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching mantra numbers, text, meaning, metadata, and audio through the backend actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines light/dark color palettes and metadata label styling using CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/selectValueGuards.ts": "Provides utility functions to validate Select values and ensure bigint selections are positive.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, components, and plugins for typography, animations, and container queries.",
  "project_state.json": "Describes the project's state, existing features, and pending requests related to deployment and sharing."
}