{
  "backend/main.mo": "Motoko backend defining Veda and mantra types with a custom comparator and a map containing sample Samaveda mantra translations.",
  "feature_evidence.json": "JSON report linking feature requirements to frontend source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose across hooks, components, scripts, and configuration.",
  "frontend/DEPLOYMENT.md": "Mainnet deployment guide detailing prerequisites, identity setup, cycles, build steps, and verification.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens for light and dark themes used across the app.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/public/_redirects": "Redirect rule routing all paths to index.html for SPA hosting.",
  "frontend/public/404.html": "SPA fallback page redirecting unknown paths to index.html while preserving the original URL as a query parameter.",
  "frontend/README.md": "Project overview with features, canister ID placeholders, template editor behavior, and tech stack notes.",
  "frontend/scripts/build.sh": "Build script performing a clean build, generating backend bindings, building frontend, and building canisters.",
  "frontend/scripts/deploy-ic.sh": "Mainnet deployment script with safety prompts, identity checks, deployment commands, and canister ID output.",
  "frontend/src/App.tsx": "Main React app handling deep links, dropdown state, mantra fetching, template editor toggling, and page layout.",
  "frontend/src/components/MantraAudioSection.tsx": "Provides audio playback and authenticated upload for mantra audio with progress tracking and error handling.",
  "frontend/src/components/MantraContentTemplate.tsx": "Loads, edits, validates, and submits mantra content templates while managing form state and clipboard copy.",
  "frontend/src/components/MantraMetadataHeader.tsx": "Displays metadata text with styling applied to tokens ending in a colon.",
  "frontend/src/components/ShareArea.tsx": "Shows the current URL and allows users to copy it via a button.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and persistence via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating mantra data using the backend actor.",
  "frontend/src/index.css": "Tailwind setup with custom light/dark theme variables and metadata label styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/selectValueGuards.ts": "Provides helpers to validate select values and ensure they match available options, plus a bigint validity check.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, fonts, containers, animations, and plugins.",
  "project_state.json": "Stores project state, issues, and feature requests related to mantra dropdown visibility and the Add-button workflow."
}