{
  "backend/main.mo": "Motoko canister defining Veda/Language enums, mantra metadata and translations, and query methods to fetch mantra numbers and meanings using Map storage.",
  "feature_evidence.json": "Feature evidence report listing frontend file impacts and related requirements for select-control fixes, dropdown behavior, and debugging guardrails.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files such as hooks, components, styling, routing, and utility logic.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme variables for light/dark modes and global background/foreground styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/public/_redirects": "Netlify-style redirects file routing all paths to index.html for SPA routing.",
  "frontend/public/404.html": "SPA-friendly 404 page that redirects unknown routes back to the app entry point.",
  "frontend/src/App.tsx": "Main React app implementing string-controlled Veda/Language/Mantra selects, deep-link parsing, URL sync, and mantra data queries.",
  "frontend/src/components/MantraAudioSection.tsx": "Component for playing and uploading mantra audio with authentication checks, progress tracking, and error handling.",
  "frontend/src/components/MantraMetadataHeader.tsx": "Metadata renderer that highlights label tokens while preserving original metadata text.",
  "frontend/src/hooks/useActor.ts": "Hook creating an authenticated or anonymous backend actor and invalidating related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks that fetch mantra-related data from the backend, including numbers, meaning, text, metadata, and audio.",
  "frontend/src/index.css": "Sets global Tailwind styles and CSS variables for light and dark themes, plus utility and component-level styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/selectValueGuards.ts": "Provides helpers to validate select values and ensure bigint selections are valid before use.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, containers, and plugins for the project.",
  "project_state.json": "Stores project metadata, known issues, and feature requirements related to fixing mantra number dropdown behavior."
}