{
  "backend/main.mo": "Motoko canister defining Veda and language types, mantra ordering, and a map storing sample Samaveda mantras 47 and 48 with translations.",
  "feature_evidence.json": "Feature evidence report listing requested frontend fixes, diagnostics additions, and affected files with metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file for build and feature tracking.",
  "frontend/DEPLOYMENT.md": "Mainnet deployment guide explaining prerequisites, steps, and verification for deploying the app to the Internet Computer.",
  "frontend/index.css": "Global Tailwind base styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Root HTML file loading the React app entry point.",
  "frontend/public/_redirects": "Redirect rule sending all paths to index.html for SPA routing.",
  "frontend/public/404.html": "SPA fallback page that redirects unknown paths to index.html while preserving the original URL.",
  "frontend/README.md": "Project overview with features, canister ID placeholders, development notes, and template editor instructions.",
  "frontend/scripts/build.sh": "Build script that cleans, installs dependencies, generates bindings, builds the frontend, and compiles canisters.",
  "frontend/scripts/deploy-ic.sh": "Script for deploying canisters to IC mainnet with safety prompts and post-deploy output.",
  "frontend/src/App.tsx": "Main React app handling routing, dropdown state, mantra fetching, inline loading/error states, and diagnostics display.",
  "frontend/src/components/DiagnosticsPanel.tsx": "Expandable diagnostics panel showing backend status, counts, and specific mantra existence with loading and error states.",
  "frontend/src/components/MantraAudioSection.tsx": "Handles loading, playing, and uploading mantra audio with authentication checks and progress tracking.",
  "frontend/src/components/MantraContentTemplate.tsx": "Loads, edits, validates, and submits mantra content templates with field parsing and form state management.",
  "frontend/src/components/MantraMetadataHeader.tsx": "Displays metadata text while visually emphasizing tokens ending with a colon.",
  "frontend/src/components/ShareArea.tsx": "Renders a share card that shows the current URL and provides a copy-to-clipboard button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to fetch mantra numbers and related text/metadata from the backend with aggressive refetching and actor-based enablement.",
  "frontend/src/index.css": "Sets global Tailwind layers and defines OKLCH-based light/dark theme variables plus utility and component styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wiring React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/selectValueGuards.ts": "Provides helpers to validate select values and ensure bigint selections are valid.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, and custom utilities using CSS variables and plugins.",
  "project_state.json": "Stores project state, issues, and feature requirements related to fixing the mantra dropdown and adding diagnostics."
}