{
  "backend/main.mo": "Implements a canister storing mantra data with types for Veda, languages, metadata, and translations, plus ordering logic and predefined Samaveda mantras 47 and 48.",
  "feature_evidence.json": "Defines feature evidence records mapping frontend files to requirements for loading mantra content and template fallback behavior.",
  "frontend-file-summaries.txt": "Collects short descriptions of all frontend files, detailing their roles in data fetching, UI components, styling, scripts, and diagnostics.",
  "frontend/DEPLOYMENT.md": "Provides a step-by-step guide for deploying the app to Internet Computer mainnet with prerequisites and identity configuration.",
  "frontend/index.css": "Tailwind CSS base layer defining OKLCH-driven color tokens and light/dark theme variables for the UI.",
  "frontend/index.html": "Minimal HTML entrypoint bootstrapping the frontend React application via main.tsx.",
  "frontend/public/_redirects": "Netlify-style rule routing all requests to index.html for SPA behavior.",
  "frontend/public/404.html": "SPA-safe 404 redirect page preserving the original path via query parameter for client-side route restoration.",
  "frontend/README.md": "High-level project overview describing app features, public URL usage, canister IDs, and development instructions.",
  "frontend/scripts/build.sh": "Script performing a clean rebuild by removing caches, regenerating bindings, installing dependencies, and building frontend and canisters.",
  "frontend/scripts/deploy-ic.sh": "Mainnet deployment script with safety prompts, canister ID output, and post-deployment verification steps for Samaveda mantras 47/48.",
  "frontend/src/App.tsx": "Main application component handling routing, dropdown state, data fetching, deep-linking, content rendering, and template preview/editor flows.",
  "frontend/src/components/DiagnosticsPanel.tsx": "Displays backend diagnostics including counts and status flags with loading and error states.",
  "frontend/src/components/MantraAudioSection.tsx": "Handles fetching, playing, and uploading mantra audio with authentication and progress tracking.",
  "frontend/src/components/MantraContentTemplate.tsx": "Manages loading, editing, validating, and submitting mantra content templates with copy and reset features.",
  "frontend/src/components/MantraMetadataHeader.tsx": "Renders metadata text and highlights label tokens ending with a colon.",
  "frontend/src/components/MantraTemplatePreview.tsx": "Shows a read‑only preview of a mantra template inside a styled card.",
  "frontend/src/components/ShareArea.tsx": "Displays the current URL and provides a copy-to-clipboard sharing control.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, and identity persistence via a React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching mantra numbers and mantra-related data (meaning, text, metadata) from the backend using an actor instance, with aggressive refetching and strict cache settings.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes, including custom OKLCH color tokens and metadata label styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up the React Query client and Internet Identity provider before rendering the App component.",
  "frontend/src/utils/selectValueGuards.ts": "Provides utilities for validating select values and ensuring bigint selections are greater than zero.",
  "frontend/tailwind.config.js": "Tailwind configuration extending fonts, colors, container settings, animations, and theme variables mapped to CSS custom properties.",
  "project_state.json": "Describes project state, known issues with mantra selection, and existing feature requirements related to displaying mantra content and template fallback behavior."
}