{
  "kind": "build_request",
  "title": "Show content when selecting Mantra 48",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure that when a user selects Samaveda Mantra 48 from the mantra dropdown, the app renders the mantra content section (metadata, text, and meaning) instead of showing an empty/no-content state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When I select mantra 48 it should display the content"
        ]
      },
      "acceptanceCriteria": [
        "Given Veda = Samaveda and Mantra Number = 48 are selected, the UI renders the Mantra Text and Meaning cards when the backend returns non-null values.",
        "The UI does not display a stale \"No content available\" message for Mantra 48 if data is available from the backend after loading completes.",
        "Switching from another mantra to Mantra 48 results in new content being displayed (no previous mantra content remains visible after loading finishes)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "If a selected mantra has no stored mantra text/meaning/metadata (all are null) but a saved template exists for that Veda + mantra number, display the saved template content in a read-only preview area within the mantra content section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When I select mantra 48 it should display the content"
        ]
      },
      "acceptanceCriteria": [
        "When mantraText, meaning, and metadata are all null for the current selection and getMantraTemplate returns a non-empty template string, the UI shows a read-only template preview instead of the generic \"No content available\" message.",
        "The template preview is visible without opening the template editor and updates when the user changes the selected mantra number.",
        "If both resolved content (text/meaning/metadata) and a template exist, the UI prefers the resolved content and does not show the template preview by default."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Do not add new Vedas, mantra datasets, or change the existing mantra text/meaning content in the backend.",
    "Do not implement external services or third-party integrations for content storage."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}