{
  "kind": "build_request",
  "title": "Fix mantra number dropdown not showing selected value and ensure options load correctly",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Veda and Language Select controls so they use string values (not Motoko variant objects) for their controlled `value` and `SelectItem value`, and reliably map those strings to the backend `Veda` / `Language` enums before calling query hooks (so `useMantraNumbers` consistently loads options).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "Still it is not showing"
        ]
      },
      "acceptanceCriteria": [
        "Changing Veda updates the mantra numbers list (e.g., Samaveda shows mantra 47 from the current dataset) without React console errors.",
        "`useMantraNumbers(selectedVeda)` is invoked with a valid backend `Veda` value (not a string or '[object Object]').",
        "The Veda dropdown trigger always shows the currently selected Veda label after selection."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the Mantra Number dropdown trigger visibly displays the selected mantra number after auto-selection and manual selection, even if the underlying Select component would otherwise render a blank trigger due to a controlled-value mismatch.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "Still it is not showing"
        ]
      },
      "acceptanceCriteria": [
        "After the app auto-selects the first available mantra number for a Veda, the Mantra Number Select trigger displays that number (not blank).",
        "After manually selecting a mantra number from the list, the Mantra Number Select trigger displays the selected number.",
        "Deep-linking to `/<veda-slug>/<number>` results in the trigger showing that mantra number when it exists in the fetched list; otherwise it falls back to the first available mantra number and shows it."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add lightweight, user-visible debugging guardrails in the mantra selection area (English text only) that render when mantra numbers are not available or when the selected mantra value does not match any loaded options, to make the failure mode obvious in deployed builds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-3"
        ],
        "quotes": [
          "Still it is not showing"
        ]
      },
      "acceptanceCriteria": [
        "When mantra numbers fail to load or are empty, the UI shows an English diagnostic message that includes: current Veda, whether numbers are loading, and the count of loaded mantra numbers.",
        "When a selected mantra value is not present in `uniqueSortedMantraNumbers`, the UI shows an English diagnostic message indicating the mismatch and the current selected value.",
        "No diagnostic UI is shown during normal operation when mantra numbers are loaded and the selected value is valid."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (compose them only).",
    "Do not edit immutable hook files: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "Keep all user-facing diagnostic and UI text in English."
  ],
  "nonGoals": [
    "Adding new backend mantra content beyond what already exists (e.g., more mantras than the current Samaveda 47 seed).",
    "Adding new features like shareable links (not requested in the latest message).",
    "Introducing any third-party analytics or logging services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}