{
  "kind": "build_request",
  "title": "Fix mantra-number dropdown showing no entries (47/48 missing) and add diagnostics for canister/data freshness",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Mantra Number dropdown so it can populate as soon as mantra numbers are fetched, even when the Veda dropdown has not been manually selected yet. Ensure the app defaults to Samaveda on first load (when there is no deep link) so the user can immediately see available mantras (including 47 and 48).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Now I'm not seeing any mantra in the dropdown either 47 or 48"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load with no deep-link URL, the Veda selection defaults to Samaveda and the Mantra Number dropdown is enabled once numbers finish loading.",
        "For Samaveda, the Mantra Number dropdown shows at least Mantra 47 and Mantra 48 (based on the current backend data).",
        "Changing the selected Veda still resets the selected mantra as it does today, without leaving the mantra dropdown permanently disabled."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve troubleshooting visibility when the mantra numbers query fails or returns empty: show a clear inline state for the Mantra Number dropdown area for (a) loading, (b) error, and (c) empty results. Error text must be user-facing English and include an actionable suggestion to refresh/reload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Now I'm not seeing any mantra in the dropdown either 47 or 48"
        ]
      },
      "acceptanceCriteria": [
        "When mantra numbers are loading, the Mantra Number control shows a loading state (not an empty dropdown).",
        "If fetching mantra numbers fails, the UI shows an error message in the selection card (not only in the console).",
        "If fetching succeeds but returns an empty list, the UI shows an explicit empty-state message (e.g., “No mantras available for this Veda.”) instead of an empty dropdown list."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a lightweight backend diagnostics query method that returns basic backend state needed to confirm the frontend is talking to the expected deployed canister (e.g., counts of mantras/metadata entries and whether Samaveda 47 and 48 exist). Expose this information in the frontend in a small, non-intrusive “Diagnostics” section (visible without authentication).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Now I'm not seeing any mantra in the dropdown either 47 or 48"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a new query method that returns diagnostics sufficient to confirm that Samaveda mantras 47 and 48 are present (true/false) and includes basic counts.",
        "Frontend displays the returned diagnostics data somewhere on the main page (collapsed panel or small card) without requiring login.",
        "If the diagnostics query fails, the frontend shows a simple English error line in the diagnostics area."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (compose existing shadcn components instead).",
    "Do not modify immutable hook files (frontend/src/hooks/useInternetIdentity.ts / .tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if state schema changes require it (avoid if possible)."
  ],
  "nonGoals": [
    "Adding new mantra content beyond what is already present in the backend.",
    "Adding new authentication methods beyond Internet Identity.",
    "Implementing real-time updates (e.g., websockets) for dropdown contents."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}