{
  "kind": "build_request",
  "title": "Fix Mantra 48 visibility in dropdown and add an Add button that opens the mantra submission template",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the Samaveda mantra number dropdown includes Mantra 48 when it exists in backend data (and that selecting Samaveda shows Mantra 48 as an available option).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Not seeing 48 mantra in the dropdown;"
        ]
      },
      "acceptanceCriteria": [
        "When Veda = Samaveda, the Mantra Number dropdown includes an option labeled \"Mantra 48\".",
        "Selecting \"Mantra 48\" updates the URL to /samaveda/48 and loads the corresponding content if available.",
        "If the backend contains Samaveda mantra 48, the backend getMantraNumbers(Samaveda) response includes 48."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a clearly visible \"Add\" button in the UI that allows the user to open the mantra content submission template/form to submit the next mantra content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "There should be a add button. When I click the add button the template should open so that I can submit the next mantra content"
        ]
      },
      "acceptanceCriteria": [
        "An \"Add\" button is visible in production builds (not only in development) and is discoverable near the mantra selection area.",
        "Clicking \"Add\" opens the mantra content template/form (it is not shown until the user clicks \"Add\").",
        "Closing the template/form returns the user to the main view without changing the current mantra selection."
      ]
    },
    {
      "id": "REQ-3",
      "text": "When the user submits a mantra content template for a mantra number that is not currently present in the dropdown for that Veda, refresh the dropdown so the newly submitted mantra number becomes selectable immediately.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "...submit the next mantra content"
        ]
      },
      "acceptanceCriteria": [
        "Submitting the template successfully triggers a refresh of the mantra numbers list for the currently selected Veda.",
        "After successful submission for a new mantra number (e.g., 48), that number appears in the Mantra Number dropdown without requiring a hard refresh.",
        "All validation and error messages shown to the user during submission are in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any other immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is allowed).",
    "Adding real-time updates via WebSockets or push notifications.",
    "Introducing external databases or off-canister storage beyond what is already used."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}