{
  "kind": "build_request",
  "title": "Publish the app and provide a publicly accessible URL",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Deploy the application (frontend + backend canisters) to the Internet Computer mainnet so it is publicly accessible without local tooling.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Please  publish  and provide the url, so that it can be viewed by everyone"
        ]
      },
      "acceptanceCriteria": [
        "The app is deployed to the IC mainnet (not local replica).",
        "A user can access the app from a standard browser on a separate network/machine without any local build steps.",
        "The deployment produces stable canister IDs for both frontend and backend canisters."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Provide the public URL for the deployed app in a human-readable form within the repository (e.g., in a root-level README) and ensure it matches the deployed frontend canister URL.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "provide the url, so that it can be viewed by everyone"
        ]
      },
      "acceptanceCriteria": [
        "A root-level README (or equivalent project documentation file) includes the exact public URL to access the app.",
        "The documented URL loads the deployed app successfully and shows the SPA (not a 404)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an in-app “Share” area that displays the current page URL and allows copying it to the clipboard, so users can easily share the publicly accessible link.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "provide the url"
        ]
      },
      "acceptanceCriteria": [
        "The UI shows the current full URL (including the selected Veda/mantra path when present).",
        "A copy action copies the URL to clipboard and provides a visible success state in English.",
        "The feature works in modern browsers without requiring authentication."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor (all Motoko logic in backend/main.mo).",
    "Do not modify files under frontend/src/components/ui or other immutablePaths; compose existing UI components instead."
  ],
  "nonGoals": [
    "Adding third-party hosting (AWS/Vercel/Netlify) or non-IC deployment targets.",
    "Adding non-Internet-Identity authentication methods.",
    "Changing mantra content/data unless required for deployment stability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "User-facing text must be in English."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}