{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Samaveda Mantra 47 dropdown visibility and add diagnostics + sensible defaults",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Ensure Mantra 47 renders/selects for Samaveda and show an English warning if Samaveda numbers load but 47 is missing.",
      "acceptanceCriteria": [
        "When the user selects Samaveda, the Mantra Number dropdown list includes option \"47\".",
        "If Samaveda is selected and the loaded mantra numbers do not include \"47\", the UI shows an English warning in the selection area that explicitly states that 47 is missing and lists the received options.",
        "Selecting \"47\" updates the Select trigger to display \"47\" and the page loads text/meaning/metadata for Samaveda mantra 47 (no blank trigger state)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the Mantra Number Select to (1) use a guarded controlled value (via the existing select value guard) to prevent blank trigger states, (2) add a Samaveda-specific diagnostic warning when numbers are loaded but 47 is missing, and (3) ensure the dropdown options always render from the sorted/de-duplicated numbers list. Use existing shadcn-ui Select and Alert components (compose/consume only; do not edit components under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/selectValueGuards.ts",
          "operation": "modify",
          "description": "If needed to support App-level guard usage, extend or refine safeSelectValue behavior so it can be used cleanly with shadcn-ui Select value props without introducing blank trigger states when a value is valid (including \"47\"). Keep behavior English-only (no user-facing strings here)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Auto-select a sensible initial Veda/mantra when only one Veda has available mantras and the session is not deep-linked.",
      "acceptanceCriteria": [
        "On first load (no deep link), if only one Veda has any mantra numbers available, that Veda is selected automatically.",
        "After the Veda is auto-selected, the first available mantra number is auto-selected and displayed in the dropdown trigger."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a first-load auto-defaulting flow: fetch mantra numbers for all Vedas (using the existing React Query hook) and, when not deep-linked, auto-select the only Veda that has any numbers. After the Veda auto-selects, ensure the first available mantra number is selected and shown in the Mantra Number Select trigger. Keep current behavior when multiple Vedas have numbers. Use existing shadcn-ui Select components (compose/consume only; do not edit components under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}