{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Samaveda Mantra 48 dropdown visibility and add production Add button to open submission template",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Samaveda mantra numbers dropdown reflects backend data (including Mantra 48) and selection deep-links to /samaveda/48.",
      "acceptanceCriteria": [
        "When Veda = Samaveda, the Mantra Number dropdown includes an option labeled \"Mantra 48\".",
        "Selecting \"Mantra 48\" updates the URL to /samaveda/48 and loads the corresponding content if available.",
        "If the backend contains Samaveda mantra 48, the backend getMantraNumbers(Samaveda) response includes 48."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust the mantra numbers query to use the backend capability that returns the complete set of available mantra numbers for a Veda (so Samaveda includes 48 when present), while preserving numeric sort + de-duplication. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the Mantra Number dropdown renders all returned numbers (including 48) and that selecting a number reliably syncs the URL to the canonical /<veda-slug>/<number> path (e.g., /samaveda/48). Keep user-facing messaging in English. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a production-visible Add button near mantra selection that opens the mantra submission template/form on demand.",
      "acceptanceCriteria": [
        "An \"Add\" button is visible in production builds (not only in development) and is discoverable near the mantra selection area.",
        "Clicking \"Add\" opens the mantra content template/form (it is not shown until the user clicks \"Add\").",
        "Closing the template/form returns the user to the main view without changing the current mantra selection."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a clearly visible \"Add\" button near the selection controls and wire it to open/close the mantra submission template without changing the current Veda/mantra selection. Remove/relax the current production gating so this workflow is available in production builds. Use the shadcn-ui Button component for consistent styling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/MantraContentTemplate.tsx",
          "operation": "modify",
          "description": "Refactor the template UI to support being opened/closed by the parent (App) and to start closed by default; keep Close behavior returning to the main view without side effects. Ensure all user-facing text remains English. Use shadcn-ui Card/Button/Alert/Textarea components as already present; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "After successful template submission for a new mantra number, refresh the mantra numbers list so the new number is immediately selectable.",
      "acceptanceCriteria": [
        "Submitting the template successfully triggers a refresh of the mantra numbers list for the currently selected Veda.",
        "After successful submission for a new mantra number (e.g., 48), that number appears in the Mantra Number dropdown without requiring a hard refresh.",
        "All validation and error messages shown to the user during submission are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the template submission mutation triggers a post-submit refresh of the mantra numbers query for the relevant Veda (and any other dependent cached queries) so new mantra numbers become selectable immediately. Keep errors surfaced to the UI in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/MantraContentTemplate.tsx",
          "operation": "modify",
          "description": "On successful submission, ensure the UI clearly indicates success in English and closes/returns control without changing the current selection, while relying on query invalidation to refresh the dropdown. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the post-submit refresh behavior into the selection experience by ensuring the dropdown list updates immediately when the underlying query refreshes, without requiring a full page reload. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}