{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Render Samaveda Mantra 48 content and template preview fallback",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix mantra content section rendering so Samaveda Mantra 48 shows metadata/text/meaning when backend returns non-null values (including empty strings), without stale no-content state.",
      "acceptanceCriteria": [
        "Given Veda = Samaveda and Mantra Number = 48 are selected, the UI renders the Mantra Text and Meaning cards when the backend returns non-null values.",
        "The UI does not display a stale \"No content available\" message for Mantra 48 if data is available from the backend after loading completes.",
        "Switching from another mantra to Mantra 48 results in new content being displayed (no previous mantra content remains visible after loading finishes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adjust query result normalization for mantraText/meaning/metadata/template to preserve valid empty-string responses (use nullish coalescing instead of truthy checks) so non-null backend values are not collapsed to null."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update content-availability detection and conditional rendering to treat non-null values (including empty strings) as displayable: compute hasValidContent using explicit null checks and render Metadata/Text/Meaning cards when values are !== null, ensuring Mantra 48 content is shown when available and preventing stale no-content UI after loading completes."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "When resolved content is missing but a saved template exists, show a read-only template preview in the mantra content section instead of the generic no-content message.",
      "acceptanceCriteria": [
        "When mantraText, meaning, and metadata are all null for the current selection and getMantraTemplate returns a non-empty template string, the UI shows a read-only template preview instead of the generic \"No content available\" message.",
        "The template preview is visible without opening the template editor and updates when the user changes the selected mantra number.",
        "If both resolved content (text/meaning/metadata) and a template exist, the UI prefers the resolved content and does not show the template preview by default."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MantraTemplatePreview.tsx",
          "operation": "create",
          "description": "Create a small read-only template preview component that displays a provided template string in a Card within the mantra content section (no editing controls), intended to be shown only when resolved content is entirely missing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire template fallback into the mantra content section: fetch the saved template for the current selection (via existing query hook), and when metadata/text/meaning are all null but a non-empty template exists, render MantraTemplatePreview instead of the generic no-content Alert; ensure resolved content remains preferred and template preview updates on mantra selection changes."
        }
      ]
    }
  ]
}