{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Mantra dropdown initialization and add diagnostics UI for data freshness",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Samaveda is the default Veda on first load (no deep link) and allow Mantra Number dropdown to populate immediately after fetch, without requiring manual Veda selection.",
      "acceptanceCriteria": [
        "On a fresh load with no deep-link URL, the Veda selection defaults to Samaveda and the Mantra Number dropdown is enabled once numbers finish loading.",
        "For Samaveda, the Mantra Number dropdown shows at least Mantra 47 and Mantra 48 (based on the current backend data).",
        "Changing the selected Veda still resets the selected mantra as it does today, without leaving the mantra dropdown permanently disabled."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update initial selection logic so when there is no deep link the app starts with selectedVedaString set to Samaveda (instead of empty), allowing useMantraNumbers to fetch immediately and the Mantra Number Select to become usable as soon as loading completes; ensure Veda changes still clear selectedMantraString and that the mantra dropdown enable/disable logic no longer depends on a manual Veda selection. Use existing shadcn-ui Select/Card/Label components to keep UI consistent (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add clear inline loading/error/empty states for the Mantra Number dropdown area when fetching mantra numbers.",
      "acceptanceCriteria": [
        "When mantra numbers are loading, the Mantra Number control shows a loading state (not an empty dropdown).",
        "If fetching mantra numbers fails, the UI shows an error message in the selection card (not only in the console).",
        "If fetching succeeds but returns an empty list, the UI shows an explicit empty-state message (e.g., “No mantras available for this Veda.”) instead of an empty dropdown list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "In the Mantra Number selection section, render an explicit inline state based on useMantraNumbers: (a) show a loading indicator/text while isLoadingNumbers is true, (b) show a user-facing English error line when numbersError is present with an actionable suggestion to refresh/reload, and (c) show an empty-state message when loading is complete and sortedMantraNumbers is empty; avoid showing an empty dropdown list as the only signal. Compose existing shadcn-ui Alert/Skeleton components as needed (Verify the component's usage instructions before implementing)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Expose backend diagnostics in the UI via a small, non-intrusive Diagnostics section visible without authentication, including graceful failure display.",
      "acceptanceCriteria": [
        "Backend exposes a new query method that returns diagnostics sufficient to confirm that Samaveda mantras 47 and 48 are present (true/false) and includes basic counts.",
        "Frontend displays the returned diagnostics data somewhere on the main page (collapsed panel or small card) without requiring login.",
        "If the diagnostics query fails, the frontend shows a simple English error line in the diagnostics area."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook (e.g., useBackendDiagnostics) that calls the existing backend capability getBackendDiagnostics, returning Diagnostics data plus loading/error state suitable for a small diagnostics UI."
        },
        {
          "path": "frontend/src/components/DiagnosticsPanel.tsx",
          "operation": "create",
          "description": "Create a small, non-intrusive Diagnostics panel component that uses the new diagnostics hook to show counts and boolean indicators for Samaveda 47/48 existence; include inline loading and a simple English error line if the query fails. Compose existing shadcn-ui Card/Alert components (and/or native HTML details/summary for collapse) rather than modifying anything under frontend/src/components/ui (Verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire DiagnosticsPanel into the main page layout (e.g., under the selection Card or near the bottom of the main content) and ensure it renders for anonymous users without adding authentication requirements. Use existing shadcn-ui layout primitives already in use in App (Verify the component's usage instructions before implementing)."
        }
      ]
    }
  ]
}